app/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    #instance variable that can be accessed from view
    @posts = Post.all

INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Testing"], ["created_at", "2014-10-14 23:15:28.365097"], ["title", "Test"], ["updated_at", "2014-10-14 23:15:28.365097"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = 2  [["content", "More"], ["updated_at", "2014-10-14 23:32:28.715025"]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(post_params)